[
  {
    "id": 1,
    "title": "Building Ethical Data Pipelines",
    "category": "Data Engineering",
    "date": "2024-04-20",
    "excerpt": "Learn how to build data pipelines that prioritize ethics, transparency, and responsible AI practices.",
    "image": "/blog/blog1.jpg",
    "content": "Full blog content here..."
  },
  {
    "id": 2,
    "title": "Understanding Attention Engineering",
    "category": "AI Ethics",
    "date": "2024-03-15",
    "excerpt": "Exploring the concept of attention-aware analytics and its applications in ethical AI systems.",
    "image": "/blog/blog2.jpg",
    "content": "Full blog content here..."
  },
  {
    "id": 3,
    "title": "Human-Centered AI Systems",
    "category": "AI Ethics",
    "date": "2024-02-10",
    "excerpt": "Designing AI systems that prioritize human values and ethical considerations.",
    "image": "/blog/blog3.jpg",
    "content": "Full blog content here..."
  },
  {
    "title": "The Age of Surveillance Capitalism: What You Need to Know",
    "description": "The Age of Surveillance Capitalism by Shoshana Zuboff is an incisive examination of how technology companies have ushered in a new economic era powered by data collection and behavior modification. Zuboff explores the rise of “behavioral futures markets,” where predictions about individuals’ actions are bought and sold, and warns of the threat posed by powerful digital architectures free from democratic oversight. The book illuminates the consequences of unchecked commercial surveillance, offering a timely warning about risks to personal autonomy, democracy, and human freedom.",
    "category": "Technology & Ethics",
    "technologies": [],
    "image": "/blog/1762594369541-Surveillance_Capitalism.jpg",
    "date": "2025-11-08",
    "excerpt": "Surveillance capitalism unilaterally claims human experience as free raw material for translation into behavioral data [which] are declared as proprietary behavioural surplus, fed into advanced manufacturing processes known as ‘machine intelligence,’ and fabricated into prediction products that anticipate what you will do now, soon, and later.” — Shoshana Zuboff",
    "content": "The digital revolution has fundamentally reshaped society — but not always for the better. Today, we live in the era of surveillance capitalism, where technology giants mine our behaviors, preferences, and private moments, not just to predict what we’ll buy, but increasingly to manipulate our decisions.​\n\nWhat Is Surveillance Capitalism?\nSurveillance capitalism is the practice where firms observe, collect, and analyze personal data at a massive scale for profit. Unlike traditional capitalism, where products and services are bought and sold, surveillance capitalism treats human experience and behavioral data as raw materials. Google, Facebook, Amazon, and similar platforms generate enormous revenues by predicting and even shaping the choices we make through sophisticated advertising and recommendation systems.​\n\nHow It Affects Us—Every Day\nEvery search you perform, post you like, and device you activate feeds into these systems. For example, searching for a “copper pan” on Google can trigger a week of targeted ads for kitchenware across different devices. With smart home products like Amazon Echo or Ring, data collection moves directly into our living rooms, creating mass data hubs at the center of daily life.​\n\nThis creates a vast power asymmetry: corporations know almost everything about us, while we know very little about their data collection and use. The consequences go beyond just seeing ads — this model affects elections, influences communities, and erodes privacy and autonomy.​\n\nWhy Should We Care?\nAs surveillance capitalism matures, companies don't only predict our behaviors; they actively intervene and shape them. This “economies of action” means our digital interfaces aren’t merely watching us — they're manipulating us with subliminal cues, social comparisons, and algorithmic nudges designed for commercial gain. This poses unprecedented threats to democracy, individual freedom, and the ability to think and act independently.​\n\nWhat Can We Do?\nAwareness is the first step. Surveillance capitalists thrive on the public staying uninformed about their activities. Demanding transparency, supporting privacy-first policies, and being more mindful of the digital platforms we use are essential actions for everyone.​\n\nShoshana Zuboff’s urgent call to “be the friction” is a reminder — it is up to all of us to resist becoming mere products for sale and to reclaim our rights as individuals in the digital age.​",
    "id": 5,
    "allowComments": true,
    "comments": [],
    "emojiReactions": {}
  },
  {
    "title": "ddddddddddddd",
    "description": "sddddddddddd",
    "category": "tyest",
    "image": "",
    "date": "2025-12-01",
    "excerpt": "",
    "content": "ssssssssssssssss",
    "allowComments": true,
    "comments": [],
    "emojiReactions": {},
    "technologies": [],
    "id": 6
  },
  {
    "title": "ddddddddddddd",
    "description": "sddddddddddd",
    "category": "tyest",
    "image": "",
    "date": "2025-12-01",
    "excerpt": "sssssssssssssss",
    "content": "ssssssssssssssss",
    "allowComments": true,
    "comments": [],
    "emojiReactions": {},
    "technologies": [],
    "id": 7
  }
]